Reports/АнализПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>АнализПродаж</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБазовая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНаценкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОтпускная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/АнализПродаж/Ext/ObjectModule.bsl
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьВидРеализации = Макет.ПолучитьОбласть("ВидРеализации");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	ОбластьАгент = Макет.ПолучитьОбласть("Агент");
	ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
	ОбластьТовар = Макет.ПолучитьОбласть("Товар");
	ОбластьРегистратор = Макет.ПолучитьОбласть("Регистратор");
	
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Продажи.Склад КАК Склад,
	|	Продажи.ВидРеализации КАК ВидРеализации,
	|	Продажи.Агент КАК Агент,
	|	Продажи.Товар КАК Товар,
	|	Продажи.Регистратор КАК Регистратор,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество,
	|	СУММА(Продажи.ОбъемОборот) КАК Объем,
	|	СУММА(Продажи.СуммаБазоваяОборот) КАК СуммаБазовая,
	|	СУММА(Продажи.СуммаСНаценкойОборот) КАК СуммаСНаценкой,
	|	СУММА(Продажи.СуммаПродажнаяОборот) КАК СуммаПродажная,
	|	СУММА(Продажи.СуммаОтпускнаяОборот) КАК СуммаОтпускная
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Дата1, &Дата2, Регистратор) КАК Продажи
	|ГДЕ
	|	ИСТИНА");
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Склад = &Склад";
	КонецЕсли;
	
	Если НЕ ВидРеализации.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И ВидРеализации = &ВидРеализации";
	КонецЕсли;
	
	Если НЕ Агент.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Агент = &Агент";
	КонецЕсли;
	
	Если НЕ Товар.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И (Товар = &Товар ИЛИ Товар В ИЕРАРХИИ (&Товар))";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	Склад,
	|	ВидРеализации,
	|	Агент,
	|	Товар,
	|	Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидРеализации,
	|	Склад.Наименование,
	|	Агент.Наименование,
	|	Товар.Наименование,
	|	Регистратор.Дата
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем),
	|	СУММА(СуммаБазовая),
	|	СУММА(СуммаСНаценкой),
	|	СУММА(СуммаПродажная),
	|	СУММА(СуммаОтпускная)
	|ПО
	|	ОБЩИЕ,";
	
	Если ПоСкладам Тогда
		Запрос.Текст = Запрос.Текст + " Склад,";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|	ВидРеализации,
	|	Агент,
	|	Товар" + ?(ПоГруппам, " ИЕРАРХИЯ", "") + ",
	|	Регистратор";

	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидРеализации", ВидРеализации);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("Агент", Агент);

	РезультатЗапроса = Запрос.Выполнить();

	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Пока ВыборкаОбщийИтог.Следующий() Цикл
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

		Если ПоСкладам Тогда
			ВыборкаСклад = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСклад.Следующий() Цикл
				СтруктураРасшифровки = Новый Структура;
				СтруктураРасшифровки.Вставить("Склад", ВыборкаСклад.Склад);
				
				ОбластьСклад.Параметры.Заполнить(ВыборкаСклад);
				ОбластьСклад.Параметры.Расшифровка = СтруктураРасшифровки;
				ТабДок.Вывести(ОбластьСклад, ВыборкаСклад.Уровень());
				
				ВыборкаВидРеализации = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаВидРеализации.Следующий() Цикл
					СтруктураРасшифровки = Новый Структура;
					СтруктураРасшифровки.Вставить("Склад", ВыборкаВидРеализации.Склад);
					СтруктураРасшифровки.Вставить("ВидРеализации", ВыборкаВидРеализации.ВидРеализации);
					
					ОбластьВидРеализации.Параметры.Заполнить(ВыборкаВидРеализации);
					ОбластьВидРеализации.Параметры.Расшифровка = СтруктураРасшифровки;
					ТабДок.Вывести(ОбластьВидРеализации, ВыборкаВидРеализации.Уровень());

					ВыборкаАгент = ВыборкаВидРеализации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаАгент.Следующий() Цикл
						СтруктураРасшифровки = Новый Структура;
						СтруктураРасшифровки.Вставить("Склад", ВыборкаАгент.Склад);
						СтруктураРасшифровки.Вставить("ВидРеализации", ВыборкаАгент.ВидРеализации);
						СтруктураРасшифровки.Вставить("Агент", ВыборкаАгент.Агент);
						
						ОбластьАгент.Параметры.Заполнить(ВыборкаАгент);
						ОбластьАгент.Параметры.Расшифровка = СтруктураРасшифровки;
						ТабДок.Вывести(ОбластьАгент, ВыборкаАгент.Уровень());

						Если ПоТоварам Тогда
							ВыборкаТовар = ВыборкаАгент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаТовар.Следующий() Цикл
								Если ВыборкаТовар.Товар.ЭтоГруппа Тогда
									ОбластьГруппа.Параметры.Заполнить(ВыборкаТовар);
									ТабДок.Вывести(ОбластьГруппа, ВыборкаТовар.Уровень());
								Иначе
									ОбластьТовар.Параметры.Заполнить(ВыборкаТовар);
									ТабДок.Вывести(ОбластьТовар, ВыборкаТовар.Уровень());
								КонецЕсли;
								
								Если Подробно Тогда
									ВыборкаРегистратор = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ВыборкаРегистратор.Следующий() Цикл
										Если ВыборкаРегистратор.Регистратор <> Неопределено И ВыборкаРегистратор.Регистратор.Дата >= НачалоДня(Период.ДатаНачала) И ВыборкаРегистратор.Регистратор.Дата <= КонецДня(Период.ДатаОкончания) Тогда
											ОбластьРегистратор.Параметры.Заполнить(ВыборкаРегистратор);
											ТабДок.Вывести(ОбластьРегистратор, ВыборкаРегистратор.Уровень());
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		Иначе
			ВыборкаВидРеализации = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаВидРеализации.Следующий() Цикл
				СтруктураРасшифровки = Новый Структура;
				СтруктураРасшифровки.Вставить("Склад", ВыборкаВидРеализации.Склад);
				СтруктураРасшифровки.Вставить("ВидРеализации", ВыборкаВидРеализации.ВидРеализации);
				
				ОбластьВидРеализации.Параметры.Заполнить(ВыборкаВидРеализации);
				ОбластьВидРеализации.Параметры.Расшифровка = СтруктураРасшифровки;
				ТабДок.Вывести(ОбластьВидРеализации, ВыборкаВидРеализации.Уровень());

				ВыборкаАгент = ВыборкаВидРеализации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаАгент.Следующий() Цикл
					СтруктураРасшифровки = Новый Структура;
					СтруктураРасшифровки.Вставить("Склад", ВыборкаАгент.Склад);
					СтруктураРасшифровки.Вставить("ВидРеализации", ВыборкаАгент.ВидРеализации);
					СтруктураРасшифровки.Вставить("Агент", ВыборкаАгент.Агент);
					
					ОбластьАгент.Параметры.Заполнить(ВыборкаАгент);
					ОбластьАгент.Параметры.Расшифровка = СтруктураРасшифровки;
					ТабДок.Вывести(ОбластьАгент, ВыборкаАгент.Уровень());

					Если ПоТоварам Тогда
						ВыборкаТовар = ВыборкаАгент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаТовар.Следующий() Цикл
							Если ВыборкаТовар.Товар.ЭтоГруппа Тогда
								ОбластьГруппа.Параметры.Заполнить(ВыборкаТовар);
								ТабДок.Вывести(ОбластьГруппа, ВыборкаТовар.Уровень());
							Иначе
								ОбластьТовар.Параметры.Заполнить(ВыборкаТовар);
								ТабДок.Вывести(ОбластьТовар, ВыборкаТовар.Уровень());
							КонецЕсли;
							
							Если Подробно Тогда
								ВыборкаРегистратор = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаРегистратор.Следующий() Цикл
									Если ВыборкаРегистратор.Регистратор <> Неопределено И ВыборкаРегистратор.Регистратор.Дата >= НачалоДня(Период.ДатаНачала) И ВыборкаРегистратор.Регистратор.Дата <= КонецДня(Период.ДатаОкончания) Тогда
										ОбластьРегистратор.Параметры.Заполнить(ВыборкаРегистратор);
										ТабДок.Вывести(ОбластьРегистратор, ВыборкаРегистратор.Уровень());
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	// Показать
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры
